n = int(input())
d = [0] * (n + 1)	
## d에 계산된 값을 저장해둔다. 
# n + 1이라고 한 이유는, 1번째 수는 사실 d[1]이 아니고 d[2]이기 때문에, 계산하기 편하게 d[1]을 1번째 인 것 처럼 만들어준다.

for i in range(2, n + 1):
    d[i] = d[i - 1] + 1 # 1 빼는 연산 -> 1회 진행 
    # ex ) d[2]의 2가 1이 되는데 필요한 최소 연산횟수 1회
    # ex ) d[4] => 2, d[3]이 1이 되는데 1회 필요해서 앞 인덱스의 +1해줄필요.
    if i % 3 == 0: # 3으로 나누어 떨어질 때 
        d[i] = min(d[i], d[i // 3] + 1)	##  d는 결과가 아닌 계산한 횟수를 저장하는 것 d[i]에는 더하지 않는 이유는 이미 1을 뺄 때 1을 더해준 이력이 있기 때문이다.
    if i % 2 == 0: # 2로 나누어 떨어질 때
        d[i] = min(d[i], d[i // 2] + 1)
print(d[n])